src/cfe/package-manager/Catalogs/пм_ИсточникиПакетов.xml
<?xml version="1.0" encoding="UTF-8"?>
<MetaDataObject version="2.20">
	<Catalog>
		<Properties>
			<Name>пм_ИсточникиПакетов</Name>
			<Hierarchical>false</Hierarchical>
			<HierarchyType>HierarchyFoldersAndItems</HierarchyType>
		</Properties>
		<ChildObjects>
			<Attribute>
				<Properties>
					<Name>Провайдер</Name>
					<Type>
						<v8:Type>cfg:EnumRef.пм_Провайдеры</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>URLСервера</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>200</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ПутьПроекта</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>200</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>IDПроекта</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>50</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ИмяПакета</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>150</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ТокенДоступа</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>200</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ТекстОшибки</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>0</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Attribute>
		</ChildObjects>
	</Catalog>
</MetaDataObject>

src/cfe/package-manager/Catalogs/пм_ИсточникиПакетов/Ext/ObjectModule.bsl
#Если Сервер Или ТолстыйКлиентОбычноеПриложение Или ВнешнееСоединение Тогда

#Область ОбработчикиСобытий

Процедура ОбработкаЗаполнения(ДанныеЗаполнения, ТекстЗаполнения, СтандартнаяОбработка)

	Если Не ЗначениеЗаполнено(Провайдер) Тогда
		Провайдер = пм_ПровайдерыПакетов.ПровайдерПоУмолчанию();
	КонецЕсли;

КонецПроцедуры

Процедура ПередЗаписью(Отказ)

	Если ОбменДанными.Загрузка Тогда
		Возврат;
	КонецЕсли;

	URLСервера = пм_МенеджерПакетовКлиентСервер.НормализованныйURL(URLСервера);
	ПутьПроекта = пм_МенеджерПакетовКлиентСервер.НормализованныйПутьПроекта(ПутьПроекта);

	// Кэш идентификатора проекта верен только для той пары сервер + путь,
	// для которой он был получен. При их изменении кэш сбрасывается.
	Если Не ЭтоНовый() Тогда
		РеквизитыДоИзменения = ОбщегоНазначенияПолучитьРеквизиты(Ссылка);
		Если РеквизитыДоИзменения <> Неопределено
			И (РеквизитыДоИзменения.URLСервера <> URLСервера
				Или РеквизитыДоИзменения.ПутьПроекта <> ПутьПроекта
				Или РеквизитыДоИзменения.Провайдер <> Провайдер) Тогда
			IDПроекта = "";
		КонецЕсли;
	КонецЕсли;

КонецПроцедуры

Процедура ОбработкаПроверкиЗаполнения(Отказ, ПроверяемыеРеквизиты)

	Если ЗначениеЗаполнено(Провайдер)
		И Не пм_ПровайдерыПакетов.ПровайдерРеализован(Провайдер) Тогда
		Отказ = Истина;
		пм_ОбщегоНазначения.СообщитьПользователю(
			СтрШаблон(НСтр("ru = 'Провайдер %1 пока не реализован.'"), Провайдер),
			ЭтотОбъект,
			"Провайдер");
	КонецЕсли;

КонецПроцедуры

#КонецОбласти

#Область СлужебныеПроцедурыИФункции

Функция ОбщегоНазначенияПолучитьРеквизиты(ИсточникСсылка)

	Запрос = Новый Запрос;
	Запрос.Текст =
		"ВЫБРАТЬ
		|	Источники.URLСервера КАК URLСервера,
		|	Источники.ПутьПроекта КАК ПутьПроекта,
		|	Источники.Провайдер КАК Провайдер
		|ИЗ
		|	Справочник.пм_ИсточникиПакетов КАК Источники
		|ГДЕ
		|	Источники.Ссылка = &Ссылка";
	Запрос.УстановитьПараметр("Ссылка", ИсточникСсылка);

	Выборка = Запрос.Выполнить().Выбрать();
	Если Не Выборка.Следующий() Тогда
		Возврат Неопределено;
	КонецЕсли;

	Реквизиты = Новый Структура("URLСервера, ПутьПроекта, Провайдер");
	ЗаполнитьЗначенияСвойств(Реквизиты, Выборка);

	Возврат Реквизиты;

КонецФункции

#КонецОбласти

#КонецЕсли
